artillery/get-payments.yml
config:
  target: "https://stage.my.sunculture.io/api/v1"
  phases:
    - duration: 60
      arrivalRate: 20
  payload:
    path: "./csv/tokens.csv"
    fields:
      - "access_token"

scenarios:
  - name: "Get Payment History"
    flow:
      - get:
          headers:
            Authorization: "Bearer {{ access_token }}"
          url: "/payment-history"