artillery/token-validation.yml
config:
  target: "https://stage.my.sunculture.io/api/v1"
  phases:
    - duration: 60
      arrivalRate: 200
  payload:
    path: "./csv/tokens.csv"
    fields:
      - "access_token"

scenarios:
  - name: "Token Validation"
    flow:
      - get:
          headers:
            Authorization: "Bearer {{ access_token }}"
          url: "/jwttoken/validation"