artillery/verify-device.yml
config:
  target: "https://stage.my.sunculture.io/api/v1"
  phases:
    - duration: 60
      arrivalRate: 20
  payload:
    path: "./csv/devices.csv"
    fields:
      - "access_token"
      - "device_id"

scenarios:
  - name: "Verify the Device"
    flow:
      - post:
          url: "/devices/verify"
          headers:
            Authorization: "Bearer {{ access_token }}"
          json:
            deviceId: !!str "869640056842126"