artillery/verify-otp.yml
config:
  target: "https://stage.my.sunculture.io/api/v1"
  phases:
    - duration: 60
      arrivalRate: 20
  payload:
    path: "./csv/otp.csv"
    fields:
      - "query"
      - "code"

scenarios:
  - name: "Verify the OTP"
    flow:
      - post:
          url: "/customer/verify-otp"
          json:
            query: "{{ query }}"
            code: "{{ code }}"